# 创建映射关系字典

# 创新、优先审批
MAPPING_INNO_PRIO = { 
    # 创新、优先审批，包含体外诊断试剂、医用软件、临床检验器械
    # 左为MD数据文件，右为db文件
    "产品ID": "产品ID",
    "产品大类": "产品大类",
    "公告时间": "发布/批准日期",
    "是否上市": "批准情况",
    "发布单位级别": "批准级别",
    "公告号": "信息来源",
    "申请人": "申请人",
    "产品名称": "产品名称",
    "境内/进口": "境内/进口",
    '产品类别':'一级类别',
    '产品分类名称':'二级类别',
    "一级类别": "一级类别",
    "二级类别": "二级类别",
    '产品描述': '描述',
    '管理类别':'管理类别',
    '预期用途':'适用领域',
    '方法学':'方法学',
    '被测物质的名称':'检测项目',
    '申请渠道': '申请渠道',
}

# 常规审批
MAPPING_NORMAL = {
    # 左为MD数据文件，右为db文件
    # 产品信息
    "产品ID": "产品ID",
    "产品名称": "产品名称",
    "产品证书编号": "注册证号",
    "批准时间": "发布/批准日期",
    "境内/进口": "境内/进口",
    "注册/备案人名称": "申请人",
    "规格型号": "规格型号",
    "管理类别": "管理类别",
    "产品大类": "产品大类",
    "一级类别": "一级类别",
    "二级类别": "二级类别",
    "结构及组成": "结构与组成",
    "适用范围": "适用领域",  
    '方法学':'方法学',
    '被测物质的名称':'检测项目',  
    '申请渠道': '申请渠道',
    }

COLUMN_NAMES = ["产品ID", "产品名称", "规格型号", "产品大类", "描述", "申请人", "发布/批准日期", "适用领域", "批准情况", "注册证号", 
                "批准级别", "管理类别", "境内/进口", "一级类别", "二级类别", "信息来源", "申请渠道", "方法学", 
                "结构与组成", "样本类型", "检测项目", "疾病领域", "技术优势", "IP拥有者", "是否在专利其内"]

IN_VITRO_TYPES = ["诊断用噬菌体", "诊断血清", "多价诊断血清", "诊断菌液", 
             "试剂", "试剂盒", "试剂包", "测定试剂盒", "检测试剂盒", "检测试剂", "确证试剂", "定型试剂", 
             "鉴定试剂", "药敏试剂", "测试条", "试纸",
             "培养基", "染色液", "稀释液", "质控品", "校准品"]

DISEASES = ['肿瘤', '癌', '甲胎蛋白', '肝', '肺', '自身抗体', '前列腺', '激素', '乳腺', 'Ig', 'IgG', '神经', 
            '心衰', '糖尿病', '抗菌药物管理', '肾', '眼']